<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"62d33e9ef326e4fc6b1ea9d5c2e5519812e1d1ddd4bb9baafa9f8308752a0e08","plan_job_ref":"Job Run Terraform plan in staging #205 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13811155649","plan_out_hash":"916581fd2042a93f2f594b2165e3bd237d7d46a556ff91a12191dd3c5a557c73","plan_hash":"602fd1420b91973010a45c03c261fb9e434c1a6ba83ac2648615ae4321d5a322","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "vQ39e6KsumA1DBr2LpwgbZ72aV78pto2s1NndZir2lU=" -> "zdbokrUq6S7xLIdBt/vXkhWtJUzj37XZQ6qJXM73FRs="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-02-20T14:35:20Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "1939e872c16e717171e1068107fdc320d2c27e24caf6769f38af5c95f9a7f7be" -> "175a3a43404fb2a33deaf8fba9e461a196ec830fb1991f4dffac53a6504ffcc8"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-02-12T13:56:36Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #205](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/13811155649)